{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report linking the change-location flow fix to App.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including components, hooks, services, and config.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app and setting the Weather Gizmos page title.",
  "frontend/src/App.tsx": "Main app component managing place selection and toggling between empty state, search, and weather panel.",
  "frontend/src/components/AdviceBanner.tsx": "Weather advice alert component selecting icons and styles based on advice type and conditions.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper with header, footer, and gradient background.",
  "frontend/src/components/EmptyState.tsx": "Landing screen with logo, hero image, description, and button to start searching for locations.",
  "frontend/src/components/Footer.tsx": "Footer displaying credits to caffeine.ai, Open‑Meteo, and OpenStreetMap.",
  "frontend/src/components/Header.tsx": "Header showing app branding, logo, name, and tagline.",
  "frontend/src/components/LocationSearch.tsx": "Location search UI with input, result list, error handling, and selection callback.",
  "frontend/src/components/WeatherPanel.tsx": "Weather display panel with current conditions, advice banner, error/loading states, and change-location action.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentWeather.ts": "Fetches current weather data for given coordinates using React Query with caching and retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePlaceSearch.ts": "Runs a deferred place‑search query against the geocoding service with short caching.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing; other hooks live in feature-specific files.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/branding.ts": "Exports the app name and tagline constants.",
  "frontend/src/lib/weatherAdvice.ts": "Generates user-facing advice messages based on weather conditions such as rain, snow, wind, or temperature.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/services/geocoding.ts": "Implements place search using Nominatim and maps results into simplified Place objects.",
  "frontend/src/services/weatherApi.ts": "Fetches current weather from Open‑Meteo and maps it to the WeatherData structure with condition interpretation.",
  "frontend/src/types/weather.ts": "Defines TypeScript interfaces for Place, WeatherData, and WeatherAdvice.",
  "frontend/tailwind.config.js": "Configures Tailwind, including theme extensions, color variables, plugins, and container settings.",
  "project_state.json": "JSON describing the project’s current state, including version info, implemented features, and pending feature requests. Contains detailed entries for backend, frontend, UI, weather logic, storage, build tooling, and known issues."
}