{
  "backend/main.mo": "Empty actor definition with no logic.",
  "feature_evidence.json": "Metadata linking features to frontend files and components for weather advice and banner rendering.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables and light/dark mode theming.",
  "frontend/index.html": "Base HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component managing location flow and rendering search, empty state, or weather panel.",
  "frontend/src/components/AdviceBanner.tsx": "Displays contextual weather advice with icons, color styling, and wrapped title/message text.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper with header, footer, and themed background.",
  "frontend/src/components/EmptyState.tsx": "Landing screen with hero image and button to start a location search.",
  "frontend/src/components/Footer.tsx": "Footer showing credits and data source attribution.",
  "frontend/src/components/Header.tsx": "Header with the app logo, title, and tagline.",
  "frontend/src/components/LocationSearch.tsx": "Search form and results list for selecting a place via geocoding API.",
  "frontend/src/components/WeatherPanel.tsx": "Shows current weather details, errors/loading states, and the generated advice banner.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentWeather.ts": "Fetches current weather data for given coordinates using React Query with caching and retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, and persisted identities.",
  "frontend/src/hooks/usePlaceSearch.ts": "Runs a geocoding search query for places, disabled by default until manually triggered.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module exporting nothing, noting that queries are defined in feature hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/weatherAdvice.ts": "Generates weather advice messages based on conditions like rain, snow, temperature, and wind.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/services/geocoding.ts": "Searches locations via Nominatim and normalizes results into Place objects.",
  "frontend/src/services/weatherApi.ts": "Fetches current weather from Open-Meteo and maps weather codes to descriptive conditions.",
  "frontend/src/types/weather.ts": "Defines TypeScript interfaces for Place, WeatherData, and WeatherAdvice.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks the project’s schema/version plus a list of implemented features for a weather app, covering backend/ frontend scaffolds, UI components, auth, weather/geocoding features, advice logic, and build/deploy tooling."
}