{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature report describing addition of the app logo to the landing empty-state screen and listing related files and metadata.",
  "frontend-file-summaries.txt": "Text listing short summaries of various frontend files and their purposes.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens, dark mode overrides, and base element styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing search and selection flow and rendering EmptyState, LocationSearch, or WeatherPanel.",
  "frontend/src/components/AdviceBanner.tsx": "Weather advice alert component selecting icons and styles based on advice type and conditions.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper adding header, footer, and gradient background around main content.",
  "frontend/src/components/EmptyState.tsx": "Landing screen showing logo, hero image, description, and button to begin location search.",
  "frontend/src/components/Footer.tsx": "Footer with attribution, credits, and external links for data sources.",
  "frontend/src/components/Header.tsx": "Header displaying app logo, name, and tagline using branding constants.",
  "frontend/src/components/LocationSearch.tsx": "Search UI for finding places with input, results list, and error handling.",
  "frontend/src/components/WeatherPanel.tsx": "Main weather display showing conditions, metrics, advice banner, and controls to retry or change location.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor via React Query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentWeather.ts": "Fetches current weather data for given coordinates with React Query and 10‑minute caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Dfinity Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/usePlaceSearch.ts": "Defines a disabled-by-default React Query hook for place search using the geocoding service.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing and documenting that query hooks live elsewhere.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme color variables and base styling.",
  "frontend/src/lib/branding.ts": "Exports the app name and tagline constants.",
  "frontend/src/lib/weatherAdvice.ts": "Generates contextual weather advice based on temperature, conditions, and wind speed.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/services/geocoding.ts": "Searches location data from Nominatim and normalizes it into Place objects.",
  "frontend/src/services/weatherApi.ts": "Fetches current weather from Open‑Meteo and maps response fields into WeatherData format.",
  "frontend/src/types/weather.ts": "Defines interfaces for Place, WeatherData, and WeatherAdvice.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling themes, custom colors, fonts, and animations.",
  "project_state.json": "Defines the current project state, listing implemented features such as Motoko backend, React/Tailwind frontend, shadcn/ui, Internet Identity auth, weather search/display, and a logo addition requirement. Also includes project metadata and feature request scaffolding."
}