{
  "backend/main.mo": "Minimal Motoko canister entry point defining an empty actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented weather app features to frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the weather application.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color themes, and light/dark mode variables using OKLCH.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing app flow between empty state, location search, and weather display using React Query.",
  "frontend/src/components/AdviceBanner.tsx": "UI component that renders contextual weather advice with icons, styling, and variants based on conditions and severity.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing consistent page structure with header, footer, and themed background.",
  "frontend/src/components/EmptyState.tsx": "Landing screen component showing a hero image, marketing copy, and a button to start location search.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution, credits, and external data source links with subtle styling.",
  "frontend/src/components/Header.tsx": "Header component showing the app logo, name, and tagline with gradient branding.",
  "frontend/src/components/LocationSearch.tsx": "Search interface allowing users to query locations, handle loading/errors, and select a place from geocoding results.",
  "frontend/src/components/WeatherPanel.tsx": "React component that fetches and displays current weather for a selected place, handling loading, error, and success states. Renders location info, advice banner, and detailed weather metrics with UI components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, falling back to anonymous access. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentWeather.ts": "React Query hook that fetches and caches current weather data for given coordinates with a 10-minute stale time and retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, status flags, and persistence via AuthClient.",
  "frontend/src/hooks/usePlaceSearch.ts": "React Query hook for searching places via geocoding, disabled by default and triggered manually, with short-term caching.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific React Query hooks are defined elsewhere.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base styles, light/dark theme CSS variables, and application-wide design tokens.",
  "frontend/src/lib/weatherAdvice.ts": "Utility that derives user-friendly weather advice based on current weather conditions such as rain, temperature, wind, and visibility.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/services/geocoding.ts": "Service for searching geographic places using the OpenStreetMap Nominatim API and mapping results to internal Place objects.",
  "frontend/src/services/weatherApi.ts": "Service that fetches current weather data from the Open-Meteo API and normalizes it into the app’s WeatherData format.",
  "frontend/src/types/weather.ts": "Type definitions for places, weather data, and derived weather advice used throughout the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, typography, animations, and plugin setup with dark mode support.",
  "project_state.json": "Defines the overall state and scope of a location-based weather app, including core features for location lookup, weather fetching, contextual advice, theming, and static assets. Tracks existing features, pending feature requests, image requirements, and basic project metadata."
}