{
  "backend/main.mo": "Defines an empty Motoko actor, serving as a placeholder backend entry point with no logic implemented.",
  "feature_evidence.json": "Documents feature evidence linking weather advice and UI rendering requirements to specific frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides a high-level mapping of frontend source files to short descriptions of their responsibilities for documentation and planning.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, OKLCH-based light/dark color variables, and base styles for consistent theming.",
  "frontend/index.html": "HTML entry point that mounts the React app to the root element and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Top-level React component managing app state, location selection flow, and React Query provider setup.",
  "frontend/src/components/AdviceBanner.tsx": "Renders contextual weather advice with icons, colors, and responsive text wrapping based on advice type and weather conditions.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper that composes the header, main content area, and footer with a responsive gradient background.",
  "frontend/src/components/EmptyState.tsx": "Landing screen component showing a hero image, introductory text, and a call-to-action to start a location search.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution, external data source credits, and branding with light/dark styling.",
  "frontend/src/components/Header.tsx": "Header component showing the app logo, title, and tagline with gradient text styling.",
  "frontend/src/components/LocationSearch.tsx": "Implements location search UI with input, results list, loading and error states, backed by a geocoding hook.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current weather data, location details, advice banner, and retry or location-change actions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor using React Query, switching between anonymous and authenticated actors based on Internet Identity. It invalidates and refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCurrentWeather.ts": "React Query hook that fetches current weather data for a given latitude and longitude with a 10-minute cache and limited retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context, handling login, logout, persisted identities, and login status using Dfinity AuthClient. Exposes hooks and a provider to access identity state throughout the app.",
  "frontend/src/hooks/usePlaceSearch.ts": "React Query hook for searching places via a geocoding service, configured to run only when manually triggered and cache results briefly.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that all React Query hooks are defined in feature-specific hook files.",
  "frontend/src/index.css": "Tailwind CSS base stylesheet defining global styles, CSS variables for light and dark themes, and a warm color palette used across the app.",
  "frontend/src/lib/weatherAdvice.ts": "Utility function that derives user-friendly weather advice messages based on current weather conditions such as rain, temperature, wind, or fog.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/services/geocoding.ts": "Service that queries the OpenStreetMap Nominatim API to search for places and normalizes results into internal Place objects.",
  "frontend/src/services/weatherApi.ts": "Service that fetches current weather data from the Open-Meteo API and maps raw response fields and weather codes into a WeatherData model.",
  "frontend/src/types/weather.ts": "Type definitions for place search results, weather data, and derived weather advice used throughout the frontend.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens via CSS variables, animations, plugins, and dark mode support.",
  "project_state.json": "Defines the project’s schema/version and a high-level summary of a weather app on Internet Computer, plus a catalog of existing features across Motoko backend, React frontend, auth, weather, UI, and build tooling. Also tracks feature updates and requirements for enhancements like actionable, emoji-inclusive weather advice and UI rendering constraints."
}