{
  "kind": "build_request",
  "title": "Add actionable weather warnings (umbrella, warm clothes, stay hydrated) with emojis",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the weather advice generation so that, based on current weather conditions, the app shows actionable warnings/advice in English that include at least: “Carry an umbrella”, “Wear warm clothes”, and “Stay hydrated”, with relevant emojis included in the user-facing title/message text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Wait I said u to add warnings like carry an umbrella,wear warm clothes,stay hydrated etc.."
        ]
      },
      "acceptanceCriteria": [
        "When current conditions indicate rain/drizzle/showers, the advice title/message explicitly tells the user to carry an umbrella and includes umbrella-related emoji(s).",
        "When current conditions indicate snow or very cold temperature, the advice title/message explicitly tells the user to wear warm clothes and includes cold/clothing emoji(s).",
        "When current conditions indicate hot temperature, the advice title/message explicitly tells the user to stay hydrated and includes water/heat emoji(s).",
        "All advice/warning copy is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the weather advice banner renders the advice title and message exactly as provided (including emojis) without truncation, and with readable wrapping in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add warnings like carry an umbrella,wear warm clothes,stay hydrated etc.."
        ]
      },
      "acceptanceCriteria": [
        "Advice titles and messages (including emojis) are fully visible and wrap gracefully on mobile and desktop.",
        "No layout regressions in light mode or dark mode when rendering longer advice messages."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (compose existing hooks/components instead).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "APK generation or Android packaging.",
    "Adding a weekly weather summary (not requested in the latest user message).",
    "Introducing new third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}