{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Actionable weather warnings with emoji-safe rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expand and standardize actionable, emoji-inclusive English weather advice for rain/cold/hot conditions.",
      "acceptanceCriteria": [
        "When current conditions indicate rain/drizzle/showers, the advice title/message explicitly tells the user to carry an umbrella and includes umbrella-related emoji(s).",
        "When current conditions indicate snow or very cold temperature, the advice title/message explicitly tells the user to wear warm clothes and includes cold/clothing emoji(s).",
        "When current conditions indicate hot temperature, the advice title/message explicitly tells the user to stay hydrated and includes water/heat emoji(s).",
        "All advice/warning copy is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/weatherAdvice.ts",
          "operation": "modify",
          "description": "Update advice generation logic and copy to ensure the user-facing title/message includes the exact actionable phrases “Carry an umbrella”, “Wear warm clothes”, and “Stay hydrated” (as applicable) and includes relevant emojis for rain/cold/hot conditions; keep all copy in English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the advice banner displays full emoji-inclusive titles/messages with readable wrapping in light and dark mode without truncation.",
      "acceptanceCriteria": [
        "Advice titles and messages (including emojis) are fully visible and wrap gracefully on mobile and desktop.",
        "No layout regressions in light mode or dark mode when rendering longer advice messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdviceBanner.tsx",
          "operation": "modify",
          "description": "Adjust the AdviceBanner layout/typography to guarantee the title and message render exactly as provided (including emojis) without truncation, using wrapping-friendly styles (e.g., no clamping, appropriate whitespace/overflow/line-height) and ensuring readable contrast in both light and dark mode. Use the shadcn-ui Alert component for the banner container (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}